# Используем базовый образ Go
FROM golang:1.22.3-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod go.sum ./

# Устанавливаем зависимости
RUN go mod download

# Копируем весь исходный код приложения
COPY . .

# Собираем приложение
RUN go build -o main ./cmd/app/main.go

# Копируем файл .env в контейнер
COPY .env ./

# Указываем порт, который будет использоваться приложением
EXPOSE 8080

# Запускаем приложение
CMD ["./main"]